sys/202.ejs

<?xml version="1.0" encoding="UTF-8"?>

<s:Envelope
    xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xs="http://www.w3.org/2001/XMLSchema"
    xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
    <s:Header>
        <wsse:Security>
           <wsse:UsernameToken wsu:Id="SecurityToken-C740D028-8F1D-C45F-E0407C0A04162BDD">
                <wsse:Username><%=username %></wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText"><%=Password %></wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
     </s:Header>
    <s:Body>
         <SYSSendMessage xmlns="https://sys.sagliknet.saglik.gov.tr/SYS/">
          
      <input>
                &lt;SYSMessage&gt;
                    &lt;messageGuid value="<%=messageGuid %>" /&gt;
                    &lt;messageType version="1" codeSystemGuid="0a9ba485-e7e0-4abb-9c86-0a14fd364bb8" code="202" value="15 - 49 Yas Kadin Izlem Veri Seti" /&gt;
                    &lt;documentGenerationTime value="<%=documentGenerationTime %>" /&gt;
                    &lt;author&gt;
                        &lt;healthcareProvider version="1" codeSystemGuid="c3eade04-4f91-5dab-e043-14031b0ac9f9" code="<%=healthcareProviderCode %>" value="<%=healthcareProviderValue %>" /&gt;
                    &lt;/author&gt;
                    &lt;firmaKodu value="<%=firmaKodu %>" /&gt;
                    &lt;recordData&gt;
            &lt;KADIN_IZLEM_15_49_YAS&gt;
                                <%if(KONJENITAL_ANOMALI_VARLIGI!=-1){ %>
                                    &lt;KONJENITAL_ANOMALI_VARLIGI version="1" codeSystemGuid="484b2fc2-d1a2-4675-872e-c2c56e72d921" code="<%=KONJENITAL_ANOMALI_VARLIGI.KODU %>" value="<%=KONJENITAL_ANOMALI_VARLIGI.ADI %>" /&gt;
                                <% }%>
                                <%if(CANLI_DOGAN_BEBEK_SAYISI!=-1){ %>
                                    &lt;CANLI_DOGAN_BEBEK_SAYISI value="<%=CANLI_DOGAN_BEBEK_SAYISI %>" /&gt;
                                        <% }%>
                                    <%if(HEMOGLOBIN!=-1){ %>
                                        &lt;HEMOGLOBIN value="<%=HEMOGLOBIN %>" /&gt;
                                    <% }%>
                                    <%if(OLU_DOGAN_BEBEK_SAYISI!=-1){ %>
                                        &lt;OLU_DOGAN_BEBEK_SAYISI value="<%=OLU_DOGAN_BEBEK_SAYISI %>" /&gt;
                                    <% }%>  
                                <%if(BIR_ONCEKI_DOGUM_DURUMU!=-1){ %>
                                    &lt;BIR_ONCEKI_DOGUM_DURUMU version="1" codeSystemGuid="d7e6d65a-b82a-6717-e040-7c0a021654a2" code="<%=BIR_ONCEKI_DOGUM_DURUMU.KODU %>" value="<%=BIR_ONCEKI_DOGUM_DURUMU.ADI %>" /&gt;
                                    <% }%>
                                    <%if(IZLEMIN_YAPILDIGI_YER!=-1){ %>
                                        &lt;IZLEMIN_YAPILDIGI_YER version="1" codeSystemGuid="c3eade04-4f91-5dab-e043-14031b0ac9f9" code="<%=IZLEMIN_YAPILDIGI_YER.KODU %>" value="<%=IZLEMIN_YAPILDIGI_YER.ADI %>" /&gt;
                                    <% }%>
                                    <%if(KULLANILAN_AILE_PLANLAMASI_YONTEMI!=-1){ %>
                                        &lt;KULLANILAN_AILE_PLANLAMASI_YONTEMI version="1" codeSystemGuid="24d08065-6a3f-4ee3-b07b-1fe5d83241c1" code="<%=KULLANILAN_AILE_PLANLAMASI_YONTEMI.KODU %>" value="<%=KULLANILAN_AILE_PLANLAMASI_YONTEMI.ADI %>" /&gt;
                                    <% }%>
                                    <%if(AILE_PLANLAMASI_YONTEMI_LOJISTIGI!=-1){ %>
                                        &lt;AILE_PLANLAMASI_YONTEMI_LOJISTIGI version="1" codeSystemGuid="8335af99-322d-4aa5-bdaa-f888b351a30a" code="<%=AILE_PLANLAMASI_YONTEMI_LOJISTIGI.KODU %>" value="<%=AILE_PLANLAMASI_YONTEMI_LOJISTIGI.ADI %>" /&gt;
                                    <% }%>
                                    <%if(PAKETE_AIT_ISLEM_ZAMANI!=-1){ %>
                                        &lt;PAKETE_AIT_ISLEM_ZAMANI value="<%=PAKETE_AIT_ISLEM_ZAMANI %>" /&gt;
                                        <% }%>
                                    <%if(ISLEM_YAPAN!=-1){ %>
                                        &lt;ISLEM_YAPAN value="<%=ISLEM_YAPAN %>" /&gt;
                                    <% }%>
                                    <%if(BILGI_ALINAN_KISI_ADI_SOYADI!=-1){ %>
                                        &lt;BILGI_ALINAN_KISI_ADI_SOYADI value="<%=BILGI_ALINAN_KISI_ADI_SOYADI %>" /&gt;
                                    <% }%>
                                    <%if(BILGI_ALINAN_KISI_TEL!=-1){ %>
                                        &lt;BILGI_ALINAN_KISI_TEL value="<%=BILGI_ALINAN_KISI_TEL %>" /&gt;
                                    <% }%>
                                    <%if(KADIN_SAGLIGI_ISLEMLERI!=-1){ %>

                                    &lt;KADIN_SAGLIGI_ISLEMLERI_BILGISI&gt;
                                    <% for(var i=0; i < KADIN_SAGLIGI_ISLEMLERI.length; i++) {%>
                                        &lt;KADIN_SAGLIGI_ISLEMLERI version="1" codeSystemGuid="9f10cc39-f47a-4611-b328-78e044a8a2bc" code="<%=KADIN_SAGLIGI_ISLEMLERI[i].KODU %>" value="<%=KADIN_SAGLIGI_ISLEMLERI[i].ADI %>" /&gt;
                                    <% }%>
                                    &lt;/KADIN_SAGLIGI_ISLEMLERI_BILGISI&gt;
                                    <% }%>
                                    <%if(AILE_PLANLAMASI_YONTEMI_KULLANMAMA_NEDENI!=-1){ %>
                                    &lt;AILE_PLANLAMASI_YONTEMI_KULLANMAMA_NEDENI_BILGISI&gt;
                                              &lt;AILE_PLANLAMASI_YONTEMI_KULLANMAMA_NEDENI version="1" codeSystemGuid="084620ca-5f25-469b-af47-158f760f16b5" code="<%=AILE_PLANLAMASI_YONTEMI_KULLANMAMA_NEDENI.KODU %>" value="<%=AILE_PLANLAMASI_YONTEMI_KULLANMAMA_NEDENI.ADI %>" /&gt;
                                    &lt;/AILE_PLANLAMASI_YONTEMI_KULLANMAMA_NEDENI_BILGISI&gt;
                                    <% }%>
                                    <%if(BIR_ONCEKI_KULLANILAN_AILE_PLANLAMASI_YONTEMI!=-1){ %>
                                    &lt;BIR_ONCEKI_KULLANILAN_AILE_PLANLAMASI_YONTEMI_BILGISI&gt;
                                            &lt;BIR_ONCEKI_KULLANILAN_AILE_PLANLAMASI_YONTEMI version="1" codeSystemGuid="636bdc8a-eea8-41cf-bcb8-b244cfa8e250" code="<%=BIR_ONCEKI_KULLANILAN_AILE_PLANLAMASI_YONTEMI.KODU %>" value="<%=BIR_ONCEKI_KULLANILAN_AILE_PLANLAMASI_YONTEMI.ADI %>" /&gt;
                                     &lt;/BIR_ONCEKI_KULLANILAN_AILE_PLANLAMASI_YONTEMI_BILGISI&gt;
                                     <% }%>
                                &lt;/KADIN_IZLEM_15_49_YAS&gt;
                                &lt;HASTA_TAKIP_BILGISI&gt;
                                    &lt;SYSTakipNo value="<%=SYSTakipNo%>" /&gt;
                                &lt;/HASTA_TAKIP_BILGISI&gt;
                                &lt;/recordData&gt;
                                &lt;/SYSMessage&gt;
                               </input>
                            </SYSSendMessage>
                            </s:Body>
                    </s:Envelope>